Repository: arshubham/cipher
Catalog: po/extra/*.po
Languages: pt

source: Cipher
pt: Cifrar

source: Encode and decode text
pt: Codificar e descodificar texto

source: cipher;crypt;cryptography;
pt: cifrar;criptar;criptografia;

source: About Cipher
pt: Sobre o Cifra

source: Add Dutch translations. Thanks @Vistaus (https://github.com/Vistaus)
pt: Adicionada tradução Holandesa. Obrigado @Vistaus (https://github.com/Vistaus)

source: Add preserve case option to Vigenere Cipher. Thanks @sahilarora3117 (https://github.com/sahilarora3117)
pt: Adicionada a opção de preservar a caixa para o Cifrar Vigenere. Obrigado @sahilarora3117 (https://github.com/sahilarora3117)

source: Add Spanish and Galician translations. Thanks @riesp (https://github.com/riesp)
pt: Adicionada tradução Espanhola e Galega. Obrigado @riesp (https://github.com/riesp)

source: New Icon! Thanks @Fatih20 (https://github.com/Fatih20)
pt: Novo Ícone! Obrigado @Fatih20 (https://github.com/Fatih20)

source: Added Vigenere Cipher
pt: Adicionada Cifra Vigenere

source: Added SHA384 and SHA512 Hash Functions
pt: Adicionada funções de Hash SHA384 e SHA51

source: Complete UI/UX Redesign!
pt: Redesenho completo da Interface do Usuário/Experiência do Usuário

source: Added i18n Capability
pt: Adicionada capacidade para i18n

source: Added French Tranlations. Thanks @NathanBnm (https://github.com/NathanBnm)
pt: Adicionada tradução Francesa. Obrigado @NathanBnm (https://github.com/NathanBnm)

source: Update for Juno
pt: Atualização para o Juno

source: Add Hashing Functions
pt: Adicionadas funções de Hashing

source: New Icon
pt: Novo Ícone

source: Fixes in .desktop file
pt: Correções do ficheiro .desktop

source: Appdata and minor language fixes
pt: Correção do Appdata e pequenas correções nas linguagens

source: A simple application for encoding and decoding text. Hide your text from prying eyes!
pt: Uma simples aplicação para codificar e descodificar texto. Esconda o seu texto de olhos curiosos!

source: Note:
pt: Nota:

source: Available Ciphers
pt: Cifras disponíveis

source: Caesar Shift Cipher
pt: Cifra Caesar Shift

source: Atbash Cipher
pt: Cifra Atbash

source: ROT13 Cipher
pt: Cifra ROT13

source: ASCII Encoding
pt: Codificação ASCII

source: Base64 Encoding
pt: Codificação Base64

source: Polybius Square Cipher
pt: Cifra Polybius Square

source: Vigenere Cipher
pt: Cifra Vigenere

source: Hashing Functions (MD5, SHA1, SHA256, SHA384, SHA512)
pt: Funções de Hash (MD5, SHA1, SHA256, SHA384, SHA512)
