Repository: arshubham/cipher
Catalog: po/*.po
Languages: es, fr, gl, it, nl, pt, sv

source: Encipher
es: Cifrar
fr: Chiffrer
gl: Cifrar
it: Cifrare
nl: Vercijferen
pt: Cifrar
sv: Chiffrera

source: Decipher
es: Descifrar
fr: Déchiffrer
gl: Descifrar
it: Decifrare
nl: Ontcijferen
pt: Decifrar
sv: Dechiffrera

source: Plain Text
es: Texto plano
fr: Texte brut
gl: Texto plano
it: Testo normale
nl: Platte tekst
pt: Texto Simples
sv: Oformaterad text

source: Cipher Text
es: Texto cifrado
fr: Texte chiffré
gl: Texto cifrado
it: Testo cifrato
nl: Tekst vercijferen
pt: Texto Cifrado
sv: Chiffrera text

source: Generate Hash
es: Generar hash
fr: Générer un Hash
gl: Xerar Hash
it: Genera un hash
nl: Hash genereren
pt: Gerar Hash
sv: Generera hash

source: Caesar Shift Cipher
es: Cifrado César
fr: Chiffre de César
gl: Cifraxe César
it: cifrario di Cesare
nl: Caesar Shift-vercijfering
pt: Cifrar Caesar Shift
sv: Caesar Shift-chiffer

source: Atbash Cipher
es: Atbash
fr: Atbash
gl: Atbash
it: Atbash
nl: Atbash-vercijfering
pt: Cifrar Atbash
sv: Atbash-chiffer

source: Polybius Square Cipher
es: Cuadrado de Polibio
fr: Carré de Polybe
gl: Cadrado de Polibio
it: quadrato di Polibio
nl: Polybius Square-vercijfering
pt: Cifrar Polybius Square
sv: Polybius Square-chiffer

source: ROT13 Cipher
es: ROT13
fr: ROT13
gl: ROT13
it: ROT13
nl: ROT13-vercijfering
pt: Cifrar ROT13
sv: ROT13-chiffer

source: Base64 Encoding
es: Codificación Base64
fr: Encodage Base64
gl: Codificación Base64
it: Codifica Base64
nl: Base64-versleuteling
pt: Codificar Base64
sv: Base64-kodning

source: Hash Functions
es: Funciones hash
fr: Fonctions de Hash
gl: Funcións hash
it: Funzioni hash
nl: Hashfuncties
pt: Funções Hash
sv: Hash-funktioner

source: ASCII Encoding
es: Codificación ASCII
fr: Encodage ASCII
gl: Codificación ASCII
it: Codifica ASCII
nl: ASCII-versleuteling
pt: Codificar ASCII
sv: ASCII-kodning

source: Vigenere Cipher
es: Cifrado de Vigenère
gl: Cifraxe de Vigenère
it: Cifra Vigenere
nl: Vigenere-vercijfering
pt: Cifrar Vigenere
sv: Vigenere-chiffer

source: Number of letters to shift to the right:
es: Número de letras para desplazar a la derecha:
fr: Nombre de lettres à décaler vers la droite :
gl: Número de letras para desprazar á dereita:
it: Numero di lettere da spostare a destra:
nl: Aantal naar rechts te verschuiven letters:
pt: Número de letras a alternar para a direita:
sv: Antal bokstäver att skifta åt höger:

source: Key must be at least 1 character long
es: La clave debe tener al menos 1 carácter de largo
gl: A clave debe ter como mínimo un carácter
it: La chiave deve contenere almeno un carattere
nl: De sleutel moet minimaal 1 teken bevatten
pt: A chave tem que ter pelo menos 1 caracter de comprimento
sv: Nyckeln måste vara åtminstone ett tecken lång

source: Key:
es: Clave:
gl: Clave:
it: Chiave:
nl: Sleutel:
pt: Chave:
sv: Nyckel:

source: Preserve Case:
es: Conservar mayúsculas y minúsculas:
gl: Conservar maiúsculas e minúsculas:
it: Conserva custodia:
nl: Hoofdlettergevoeligheid behouden:
pt: Preservar Chave:
sv: Bevara skiftläge:

source: An simple app for encoding and decoding text
es: Una aplicación simple para codificar y decodificar texto
fr: Une simple application pour encoder et décoder du texte
gl: Un aplicativo sinxelo para codificar e descodificar texto
nl: Een eenvoudige toepassing voor het ver- en ontsleutelen van tekst

source: Light background
es: Tema claro
fr: Thème clair
gl: Tema claro
it: Tema chiaro
nl: Licht thema
pt: Fundo Claro
sv: Ljus bakgrund

source: Dark background
es: Tema oscuro
fr: Thème sombre
gl: Tema escuro
it: Tema scuro
nl: Donker thema
pt: Fundo Escuro
sv: Mörk bakgrund

source: Click to learn more about %s on Wikipedia
es: Haga clic para obtener más información sobre %s en Wikipedia
fr: Cliquez pour en savoir plus sur %s sur Wikipédia
gl: Faga clic para obter máis información sobre %s na Wikipedia
it: Fai clic per saperne di pi√π su %s su Wikipedia
nl: Klik voor Wikipedia-informatie over '%s'
pt: Clique para aprender mais sobre %s na Wikipédia
sv: Klicka för att läsa mer om %s på Wikipedia

source: Encode and decode text
es: Codifique y descodifique texto
fr: Encodez et décodez du texte
gl: Codifique e descodifique texto
nl: Tekst ver- en ontsleutelen

source: cipher;crypt;cryptography;
es: cifrado;encriptar;criptografía;
fr: cipher;cryptage;cryptographie;
gl: cifrado;encriptar;criptografía;
nl: vercijferen;kluis;cryptografie;

source: About Cipher
es: Sobre Cipher
fr: À propos de Cipher
gl: Sobre Cipher
nl: Over Cipher

source: New Icon! Thanks @Fatih20 (https://github.com/Fatih20)
es: ¡Nuevo icono! Gracias @Fatih20 (https://github.com/Fatih20)
gl: Nova icona! Grazas @Fatih20 (https://github.com/Fatih20)
nl: Nieuw pictogram, met dank aan @Fatih20 (https://github.com/Fatih20)

source: Added Vigenere Cipher
es: Añadido el cifrado de Vigenère
gl: Engadido o cifraxe de Vigenère
nl: Vigenere-vercijfering toegevoegd

source: Added SHA384 and SHA512 Hash Functions
es: Añadidas las funciones «hash» SHA384 y SHA512
gl: Engadidas as funcións hash SHA384 e SHA512
nl: SHA384- en SHA512-hashfuncties toegevoegd

source: Complete UI/UX Redesign!
es: ¡Rediseño completo de UI/UX!
fr: Refonte complète de l'interface
gl: ¡Redeseño completo de UI/UX!
nl: Gloednieuw uiterlijk!

source: Added i18n Capability
es: Añadida la capacidad i18n
fr: Ajout de la compatibilité i18n
gl: Capacidade i18n engadida
nl: Vertaalmogelijkheid toegevoegd

source: Added French Tranlations. Thanks @NathanBnm (https://github.com/NathanBnm)
es: Añadida la traducción al francés. Gracias @NathanBnm (https://github.com/NathanBnm)
fr: Ajout des traductions françaises. Merci @NathanBnm (https://github.com/NathanBnm)
gl: Engadida a tradución ao francés. Grazas @NathanBnm (https://github.com/NathanBnm)
nl: Franse vertaling toegevoegd, met dank aan @NathanBnm (https://github.com/NathanBnm)

source: Update for Juno
es: Actualización para Juno
fr: Mise à jour pour Juno
gl: Actualización para Juno
nl: Update voor Juno

source: Add Hashing Functions
es: Añadir funciones de «hash»
fr: Ajout des fonctions de hachage
gl: Engadir funcións de hash
nl: Hashfuncties toegevoegd

source: New Icon
es: Nuevo icono
fr: Nouvelle icône
gl: Nova icona
nl: Nieuw pictogram

source: Fixes in .desktop file
es: Correcciones en el fichero .desktop
fr: Corrections dans le fichier .desktop
gl: Correccións no ficheiro .desktop
nl: Reparaties aan het .desktop-bestand

source: Appdata and minor language fixes
es: Appdata y correcciones menores de idioma
fr: Corrections du fichier Appdata et et langage mineures
gl: Appdata e correccións menores de idioma
nl: Reparaties aan de appgegevens en vertalingen

source: A simple application for encoding and decoding text. Hide your text from prying eyes!
es: Una aplicación simple para codificar y decodificar texto. ¡Oculte su texto de miradas indiscretas!
gl: Un aplicativo sinxelo para codificar e descodificar texto. Agoche o seu texto dos ollos indiscretos!
nl: Een eenvoudige toepassing voor het ver- en ontsleutelen van tekst. Verberg je tekst voor nieuwsgierige aagjes!

source: Note:
es: Nota:
gl: Nota:
nl: Opmerking:

source: Available Ciphers
es: Cifrados disponibles
fr: Chiffrements disponibles
gl: Cifraxes dispoñíbeis
nl: Beschikbare vercijferingen

source: Hashing Functions (MD5, SHA1, SHA256, SHA384, SHA512)
es: Funciones de «hash» (MD5, SHA1, SHA256, SHA384, SHA512)
gl: Funcións de hash (MD5, SHA1, SHA256, SHA384, SHA512)
nl: Hashfuncties (MD5, SHA1, SHA256, SHA384, SHA512)

source: Cipher
it: Cifra
pt: Cifrar
sv: Chiffer

source: Back
it: Indietro
pt: Voltar
sv: Tillbaka
